Tekla Open API Reference for Tekla Structures 2025
Operation.Split Method (ContourPlate, Polygon)
 Splits the contour plate and creates a new one along the given polygon.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static ContourPlate Split(
	ContourPlate Object,
	Polygon SplitPolygon
)
Public Shared Function Split (
	Object As ContourPlate,
	SplitPolygon As Polygon
) As ContourPlate
Parameters
Object
Type: Tekla.Structures.Model.ContourPlate
The contour plate object to be splitted.
SplitPolygon
Type: Tekla.Structures.Model.Polygon
The position where splitting is executed.
Return Value
Type: ContourPlate
The created contour plate on success, null on failure.
See Also
Reference
Operation Class
Split Overload
Tekla.Structures.Model.Operations Namespace